In [5]:
import pandas as pd
import numpy as np

In [ ]:
arr=[0,1,2,3,4]
data=pd.Series(arr)

In [6]:
ordering=[1,2,3,4,5]
data1=pd.Series(arr,index=ordering)
data1

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [7]:
n=np.random.randn(5)
indexing=['a','b','c','d','e']
s1=pd.Series(n,index=indexing)
s1

a   -0.709854
b   -0.281735
c    0.452968
d    0.338947
e    0.648680
dtype: float64

In [11]:
dict={1:'a',2:'b',3:'c',4:'f'}
dict
s2=pd.Series(dict)
s2

1    a
2    b
3    c
4    f
dtype: object

In [6]:
print(data1)
data1.index=['A','B','C','D','E']
data1

1    0
2    1
3    2
4    3
5    4
dtype: int64

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [7]:
# slicing
slicing_data1=data1[:3]
slicing_data1

A    0
B    1
C    2
dtype: int64

In [8]:
s3=data1.append(s2)
s3

A    0
B    1
C    2
D    3
E    4
1    a
2    b
3    c
4    f
dtype: object

In [9]:
s3.drop('E')

A    0
B    1
C    2
D    3
1    a
2    b
3    c
4    f
dtype: object

In [10]:
#Operatins(series)
arr1=[1,2,3,4,5,8]
arr2=[6,7,8,9]

In [11]:
s4=pd.Series(arr2)
s4

0    6
1    7
2    8
3    9
dtype: int64

In [12]:
s5=pd.Series(arr1)
s5

0    1
1    2
2    3
3    4
4    5
5    8
dtype: int64

In [13]:
s5.add(s4)

0     7.0
1     9.0
2    11.0
3    13.0
4     NaN
5     NaN
dtype: float64

In [14]:
s5.sub(s4)

0   -5.0
1   -5.0
2   -5.0
3   -5.0
4    NaN
5    NaN
dtype: float64

In [15]:
s6=s5.mul(s4)
s6

0     6.0
1    14.0
2    24.0
3    36.0
4     NaN
5     NaN
dtype: float64

In [16]:
s5.div(s4)

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4         NaN
5         NaN
dtype: float64

In [17]:
print('median',s6.median())
print('mode',s6.mode())
print('max',s6.max())
print('min',s6.min())

median 19.0
mode 0     6.0
1    14.0
2    24.0
3    36.0
dtype: float64
max 36.0
min 6.0

In [18]:
mode_find=pd.Series([2,2,3,4])
mode_find.mode()

0    2
dtype: int64

## DataFrames

In [3]:
dates_of_days=pd.date_range('today',periods=6) # time sequence for indexing
dates_of_days
numpy_arr=np.random.randn(6,4)  #generating 6*4 random data
numpy_arr
columns=['a','b','c','d']
df=pd.DataFrame(numpy_arr,index=dates_of_days,columns=columns)
df

                                   a         b         c         d
2020-07-24 07:18:34.805033 -0.909328 -1.594626  0.952773 -1.282585
2020-07-25 07:18:34.805033  0.611858 -0.499265 -0.739434  1.266561
2020-07-26 07:18:34.805033  0.287277  0.035467  0.482590  1.259683
2020-07-27 07:18:34.805033 -0.179321  0.379595  1.491991 -0.069348
2020-07-28 07:18:34.805033  0.311421  0.460826 -0.329390 -0.822273
2020-07-29 07:18:34.805033  1.162852  0.360416  1.227055 -2.708664

In [28]:
# creating DataFrame with dictionary array
data={'app':['gpay','phonepay','paytm','amazonpay','bharathpe','Bhim UPI','Paypal'],
      'rating':[4.3,4.4,4.5,4.0,np.nan,4.0,np.nan],
      'reviews':[32303,20212,24383,45383,15053,18457,90929],
      'priority':['yes','yes','yes','yes','no','no','yes']}
      
    
lables=['a','b','c','d','e','f','g']

In [29]:
df1=pd.DataFrame(data,index=lables)
df1

         app  rating  reviews priority
a       gpay     4.3    32303      yes
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
d  amazonpay     4.0    45383      yes
e  bharathpe     NaN    15053       no
f   Bhim UPI     4.0    18457       no
g     Paypal     NaN    90929      yes

In [16]:
# To check the datatypes use dtypes
df1.dtypes

app          object
rating      float64
reviews       int64
priority     object
dtype: object

In [30]:
df1.head()

         app  rating  reviews priority
a       gpay     4.3    32303      yes
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
d  amazonpay     4.0    45383      yes
e  bharathpe     NaN    15053       no

In [32]:
df1.tail()

         app  rating  reviews priority
e  bharathpe     NaN    15053       no
f   Bhim UPI     4.0    18457       no
g     Paypal     NaN    90929      yes

In [25]:
print(df1.index)
df1.columns

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

Index(['app', 'rating', 'reviews', 'priority'], dtype='object')

In [26]:
df1.values

array([['gpay', 4.3, 32303, 'yes'],
       ['phonepay', 4.4, 20212, 'yes'],
       ['paytm', 4.5, 24383, 'yes'],
       ['amazonpay', 4.0, 45383, 'yes'],
       ['bharathpe', nan, 15053, 'no'],
       ['Bhim UPI', 4.0, 18457, 'no'],
       ['Paypal', nan, 90929, 'yes']], dtype=object)

In [28]:
# Statistical data
df1.describe()

         rating       reviews
count  5.000000      7.000000
mean   4.240000  35245.714286
std    0.230217  26600.971791
min    4.000000  15053.000000
25%    4.000000  19334.500000
50%    4.300000  24383.000000
75%    4.400000  38843.000000
max    4.500000  90929.000000

In [29]:
df1.T

              a         b      c          d          e         f       g
app        gpay  phonepay  paytm  amazonpay  bharathpe  Bhim UPI  Paypal
rating      4.3       4.4    4.5          4        NaN         4     NaN
reviews   32303     20212  24383      45383      15053     18457   90929
priority    yes       yes    yes        yes         no        no     yes

In [30]:
df1.sort_values(by='reviews')

         app  rating  reviews priority
e  bharathpe     NaN    15053       no
f   Bhim UPI     4.0    18457       no
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
a       gpay     4.3    32303      yes
d  amazonpay     4.0    45383      yes
g     Paypal     NaN    90929      yes

In [35]:
# Slicing DataFrame
df1[0:5]

         app  rating  reviews priority
a       gpay     4.3    32303      yes
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
d  amazonpay     4.0    45383      yes
e  bharathpe     NaN    15053       no

In [33]:
df1.sort_values(by='reviews')[0:4]

         app  rating  reviews priority
e  bharathpe     NaN    15053       no
f   Bhim UPI     4.0    18457       no
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes

In [37]:
# Selecting required columns from DataFrame
df1[['app','rating']]

         app  rating
a       gpay     4.3
b   phonepay     4.4
c      paytm     4.5
d  amazonpay     4.0
e  bharathpe     NaN
f   Bhim UPI     4.0
g     Paypal     NaN

In [40]:
# using iloc instead of slicing
df1.iloc[1:3]

        app  rating  reviews priority
b  phonepay     4.4    20212      yes
c     paytm     4.5    24383      yes

In [36]:
df2=df1.copy()
df2

         app  rating  reviews priority
a       gpay     4.3    32303      yes
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
d  amazonpay     4.0    45383      yes
e  bharathpe     NaN    15053       no
f   Bhim UPI     4.0    18457       no
g     Paypal     NaN    90929      yes

In [41]:
df2.isnull()

     app  rating  reviews  priority
a  False   False    False     False
b  False   False    False     False
c  False   False    False     False
d  False   False    False     False
e  False    True    False     False
f  False   False    False     False
g  False    True    False     False

In [38]:
df2.loc['f','priority']='yes'
df2

         app  rating  reviews priority
a       gpay     4.3    32303      yes
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
d  amazonpay     4.0    45383      yes
e  bharathpe     NaN    15053       no
f   Bhim UPI     4.0    18457      yes
g     Paypal     NaN    90929      yes

In [37]:
df2.mean()

35245.71428571428

In [44]:
df2['reviews'].sum()

246720

In [46]:
df2.sum()

app         gpayphonepaypaytmamazonpaybharathpeBhim UPIPaypal
rating                                                   21.2
reviews                                                246720
priority                                 yesyesyesyesnoyesyes
dtype: object

In [39]:
# String Operations
strings=pd.Series(['A','DS','DF','ba','jfgs','aB'])
print(strings.str.upper())
strings.str.lower()

0       A
1      DS
2      DF
3      BA
4    JFGS
5      AB
dtype: object

0       a
1      ds
2      df
3      ba
4    jfgs
5      ab
dtype: object

## Missing Values

In [51]:
df3=df2.copy()
df3

         app  rating  reviews priority
a       gpay     4.3    32303      yes
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
d  amazonpay     4.0    45383      yes
e  bharathpe     NaN    15053       no
f   Bhim UPI     4.0    18457      yes
g     Paypal     NaN    90929      yes

In [53]:
df3.fillna(4)

         app  rating  reviews priority
a       gpay     4.3    32303      yes
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
d  amazonpay     4.0    45383      yes
e  bharathpe     4.0    15053       no
f   Bhim UPI     4.0    18457      yes
g     Paypal     4.0    90929      yes

In [54]:
df4=df2.copy()
df4

         app  rating  reviews priority
a       gpay     4.3    32303      yes
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
d  amazonpay     4.0    45383      yes
e  bharathpe     NaN    15053       no
f   Bhim UPI     4.0    18457      yes
g     Paypal     NaN    90929      yes

In [55]:
df4.dropna()

         app  rating  reviews priority
a       gpay     4.3    32303      yes
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
d  amazonpay     4.0    45383      yes
f   Bhim UPI     4.0    18457      yes

In [56]:
df4.dropna(how='any')

         app  rating  reviews priority
a       gpay     4.3    32303      yes
b   phonepay     4.4    20212      yes
c      paytm     4.5    24383      yes
d  amazonpay     4.0    45383      yes
f   Bhim UPI     4.0    18457      yes

In [6]:
df2.columns

NameError: name 'df2' is not defined